Catalogs/Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Услуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПотребителяУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеНормПотребления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияНормПотребления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияРасчетнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеПрибораУчетаДляЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬУсловиеРасчетаЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДополнительнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговыйМетод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорогов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетаПоСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаПоСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаПоСредней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВидамТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьЭнергоемкость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУХолоднаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУГарячаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвоКубов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслугиПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Тарифы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНормеЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТарифыПороговые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТарифыПороговые</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыНачисленияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыНачисленияУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПоказаниямПрибораУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуЖильцов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуМашиноМест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНормамПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРасчетнымЗначениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммисияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДополнительнымРеквизитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуПриборов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОснованияНормПотребления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ОснованияНормПотребления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Площадь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинЧеловек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Услуги/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Истина;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Истина;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Истина;
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоКоличествуПриборов Тогда
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Истина;
		//Элементы.ПУХолоднаяВода.Видимость = Истина;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоКоличествуЖильцов Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Истина;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;	
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоПлощади Тогда
		
		Элементы.ВидПлощади.Видимость = Истина;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоНормамПотребления Тогда
		
		Элементы.ОснованиеНормПотребления.Видимость = Истина;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
		Если Объект.ОснованиеНормПотребления = Перечисления.ОснованияНормПотребления.ОдинЧеловек Тогда
			Элементы.ВидПотребителяУслуг.Видимость = Истина;	
			Элементы.ВидПлощади.Видимость = Ложь;	
			
		ИначеЕсли Объект.ОснованиеНормПотребления = Перечисления.ОснованияНормПотребления.Площадь Тогда
			Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
			Элементы.ВидПлощади.Видимость = Истина;	
			
		ИначеЕсли Объект.ОснованиеНормПотребления = Перечисления.ОснованияНормПотребления.ДополнительныйРеквизит Тогда
			Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
			Элементы.ВидПлощади.Видимость = Ложь;	
			Элементы.ДополнительныйРеквизит.Видимость = Истина;
			
		Иначе
			Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
			Элементы.ВидПлощади.Видимость = Ложь;	
		КонецЕсли;
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ФиксированноеНачисление Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоКоличествуМашиноМест Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Истина;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоРасчетнымЗначениям Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Истина;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Истина;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Истина;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоДополнительнымРеквизитам Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Истина;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	Иначе
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;	
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	КонецЕсли;
	
	Если Объект.СпособНачисления <> Перечисления.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета И Объект.ПороговыйМетод Тогда
		
		Объект.ПороговыйМетод = Ложь;
		
	КонецЕсли;
	
	Если Объект.ПороговыйМетод Тогда
		
		Элементы.КоличествоПорогов.Видимость = Истина;
		
	Иначе
		
		Элементы.КоличествоПорогов.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Объект.ВидРасчетаПоСредней = Перечисления.ВидыРасчетаПоСредней.ПоПрошлымМесяцам Тогда
		Элементы.БазаДляРасчетаПоСредней.Видимость = Истина;
		Элементы.ГруппаДатыСезона.Видимость = Ложь;
	ИначеЕсли Объект.ВидРасчетаПоСредней = Перечисления.ВидыРасчетаПоСредней.ЗаПрошлыйСезон Тогда
		Элементы.БазаДляРасчетаПоСредней.Видимость = ложь;
		Элементы.ГруппаДатыСезона.Видимость = Истина;
	Иначе
		Элементы.БазаДляРасчетаПоСредней.Видимость = ложь;
		Элементы.ГруппаДатыСезона.Видимость = ложь;
	КонецЕсли;	
		
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасширениеНачисленийЛицевыхСчетов") Тогда
		Элементы.СпособНачисления.СписокВыбора.Добавить(Перечисления.СпособыНачисленияУслуг.ПоДополнительнымРеквизитам);
		Элементы.ОснованиеНормПотребления.СписокВыбора.Добавить(Перечисления.ОснованияНормПотребления.ДополнительныйРеквизит);
	КонецЕсли;
	
	Элементы.Ресурсная.Видимость  = ПолучитьФункциональнуюОпцию("ИспользоватьАвансовыеПлатежи");
	
	Если Объект.ПоВидамТарифа Тогда
		
		Элементы.ВидыТарифов.Видимость = Истина;
		
	Иначе
		
		Элементы.ВидыТарифов.Видимость = Ложь;
		
	КонецЕсли;

	
КонецПроцедуры // УстановитьВидимостьИДоступность()

&НаСервере
Функция КонтрольВыбранногоЗначения(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = Объект.Ссылка Тогда
	
		Возврат Ложь;	
	
	КонецЕсли; 
	
	ВыборкаСтрок = Объект.СоставныеУслуги.НайтиСтроки(Новый Структура("Услуга", ВыбранноеЗначение));
	
	Если ВыборкаСтрок.Количество() > 0 Тогда
	
		Возврат Ложь;	
	
	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура СпособНачисленияПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеНормПотребленияПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставныеУслугиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ КонтрольВыбранногоЗначения(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка =Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПороговыйМетодПриИзменении(Элемент)
	
	Если ПороговыйМетодПриИзмененииНаСервере() Тогда
	
		Объект.ПороговыйМетод = Не Объект.ПороговыйМетод;
	
	КонецЕсли; 
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

&НаСервере
Функция ПороговыйМетодПриИзмененииНаСервере()

	Если Объект.ПороговыйМетод Тогда
		ТаблицаТарифов = РегистрыСведений.Тарифы.СрезПоследних( , Новый Структура("Услуга", Объект.Ссылка));
		Если ТаблицаТарифов.Количество() > 0  Тогда
			Если ТаблицаТарифов.Итог("ЗначениеТарифа") > 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Установлен тариф. Изменение метода запрещено до отмены тарифа.';uk='Встановлено тариф. Зміна методу заборонено до скасування тарифу.'"));
			    Возврат Истина;
			КонецЕсли; 			
		КонецЕсли; 
	
	Иначе	
		ТаблицаПорогов = РегистрыСведений.ТарифыПороговые.СрезПоследних( , Новый Структура("Услуга", Объект.Ссылка));
		Если ТаблицаПорогов.Количество() > 0  Тогда
			Если ТаблицаПорогов.Итог("ЗначениеТарифа") > 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Установлены пороговые тарифы. Изменение метода запрещено до отмены пороговых тарифов.';uk='Встановлено порогові тарифи. Зміна методу заборонено до скасування порогових тарифів.'"));
			    Возврат Истина;
			КонецЕсли; 			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ВидРасчетаПоСреднейПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПоВидамТарифаПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ВидыТарифов.Сортировать("ВидТарифа ВОЗР");
КонецПроцедуры

&НаКлиенте
Процедура СоставныеУслугиУслугаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СоставныеУслуги.ТекущиеДанные;
	ТекущаяСтрока.Коэффициент = 1;
КонецПроцедуры
